Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_qtmr.c
/****************************************************************************
 *
 * Copyright 2019 NXP Semiconductors All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied. See the License for the specific
 * language governing permissions and limitations under the License.
 *
 ****************************************************************************/
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <stdint.h>
#include <string.h>
#include <debug.h>
#include <errno.h>

#include <tinyara/clock.h>
#include <tinyara/timer.h>
#include <tinyara/irq.h>

#include "imxrt_clock.h"
#include "imxrt_qtmr.h"

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Gets the instance from the base address to be used to gate or ungate the module clock
 *
 * @param base Quad Timer peripheral base address
 *
 * @return The Quad Timer instance
 */
static uint32_t imxrt_qtmr_getinstance(TMR_Type *base);
static int imxrt_qtmr_handler(int irq, void *context, void *arg);
static void imxrt_qtmr_setisr(struct imxrt_qtmr_chipinfo_s *qtmr, xcpt_t handler, void *arg);
static void imxrt_qtmr_setcallback(struct timer_lowerhalf_s *lower, tccb_t callback, void *arg);
static int imxrt_qtmr_settimeout(struct timer_lowerhalf_s *lower, uint32_t timeout);
static int imxrt_qtmr_getstatus(struct timer_lowerhalf_s *lower, struct timer_status_s *status);
static int imxrt_qtmr_ioctl(struct timer_lowerhalf_s *lower, int cmd, unsigned long arg);
static int imxrt_qtmr_stop(struct timer_lowerhalf_s *lower);
static int imxrt_qtmr_start(struct timer_lowerhalf_s *lower);
int imxrt_qtmr_initialize(const char *devpath, int timer);

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Pointers to Quad Timer bases for each instance. */
static TMR_Type *const s_qtmrBases[] = TMR_BASE_PTRS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Pointers to Quad Timer clocks for each instance. */
static const clock_ip_name_t s_qtmrClocks[] = TMR_CLOCKS;
#endif							/* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

static struct imxrt_qtmr_chipinfo_s imxrt_qtmr0_chipinfo = {
	.base = TMR1,
	.irq_id = IMXRT_IRQ_QTIMER1,
};

static struct imxrt_qtmr_chipinfo_s imxrt_qtmr1_chipinfo = {
	.base = TMR2,
	.irq_id = IMXRT_IRQ_QTIMER2,

};

static struct imxrt_qtmr_chipinfo_s imxrt_qtmr2_chipinfo = {
	.base = TMR3,
	.irq_id = IMXRT_IRQ_QTIMER3,
};

static struct imxrt_qtmr_chipinfo_s imxrt_qtmr3_chipinfo = {
	.base = TMR4,
	.irq_id = IMXRT_IRQ_QTIMER4,
};

struct imxrt_qtmr_lowerhalf_s {
	const struct timer_ops_s *ops;		/* Lowerhalf operations */
	struct imxrt_qtmr_chipinfo_s *qtmr;
	qtmr_config_t config;
	bool started;				/* True: Timer has been started */
	tccb_t callback;
	void *arg;				/* Argument passed to upper half callback */
	qtmr_channel_selection_t channel;
	qtmr_selection_t tmr;
};

static const struct timer_ops_s qtmr_timer_ops = {
	.start = imxrt_qtmr_start,
	.stop = imxrt_qtmr_stop,
	.getstatus = imxrt_qtmr_getstatus,
	.settimeout = imxrt_qtmr_settimeout,
	.setcallback = imxrt_qtmr_setcallback,
	.ioctl = imxrt_qtmr_ioctl,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr0_0_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_0,
	.tmr = kQTMR_0,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr0_1_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_1,
	.tmr = kQTMR_0,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr0_2_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_2,
	.tmr = kQTMR_0,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr0_3_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_3,
	.tmr = kQTMR_0,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr1_0_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_0,
	.tmr = kQTMR_1,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr1_1_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_1,
	.tmr = kQTMR_1,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr1_2_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_2,
	.tmr = kQTMR_1,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr1_3_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_3,
	.tmr = kQTMR_1,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr2_0_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_0,
	.tmr = kQTMR_2,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr2_1_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_1,
	.tmr = kQTMR_2,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr2_2_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_2,
	.tmr = kQTMR_2,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr2_3_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_3,
	.tmr = kQTMR_2,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr3_0_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_0,
	.tmr = kQTMR_3,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr3_1_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_1,
	.tmr = kQTMR_3,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr3_2_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_2,
	.tmr = kQTMR_3,
};

static struct imxrt_qtmr_lowerhalf_s g_qtmr3_3_lowerhalf = {
	.ops = &qtmr_timer_ops,
	.channel = kQTMR_Channel_3,
	.tmr = kQTMR_3,
};

/*******************************************************************************
 * Code
 ******************************************************************************/
static uint32_t imxrt_qtmr_getinstance(TMR_Type *base)
{
	uint32_t instance;

	/* Find the instance index from base address mappings. */
	for (instance = 0; instance < ARRAY_SIZE(s_qtmrBases); instance++) {
		if (s_qtmrBases[instance] == base) {
			break;
		}
	}

