Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_qtmr.c
	assert(instance < ARRAY_SIZE(s_qtmrBases));

	return instance;
}

/*!
 * brief Ungates the Quad Timer clock and configures the peripheral for basic operation.
 *
 * note This API should be called at the beginning of the application using the Quad Timer driver.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param config   Pointer to user's Quad Timer config structure
 */
void imxrt_qtmr_init(TMR_Type *base, qtmr_channel_selection_t channel, const qtmr_config_t *config)
{
	assert(config);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
	/* Enable the module clock */
	imxrt_clock_enableclock(s_qtmrClocks[imxrt_qtmr_getinstance(base)]);
#endif							/* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

	/* Setup the counter sources */
	base->CHANNEL[channel].CTRL = (TMR_CTRL_PCS(config->primarySource) | TMR_CTRL_SCS(config->secondarySource));

	/* Setup the master mode operation */
	base->CHANNEL[channel].SCTRL = (TMR_SCTRL_EEOF(config->enableExternalForce) | TMR_SCTRL_MSTR(config->enableMasterMode));

	/* Setup debug mode */
	base->CHANNEL[channel].CSCTRL = TMR_CSCTRL_DBG_EN(config->debugMode);

	base->CHANNEL[channel].FILT &= ~(TMR_FILT_FILT_CNT_MASK | TMR_FILT_FILT_PER_MASK);
	/* Setup input filter */
	base->CHANNEL[channel].FILT = (TMR_FILT_FILT_CNT(config->faultFilterCount) | TMR_FILT_FILT_PER(config->faultFilterPeriod));
}

/*!
 * brief Stops the counter and gates the Quad Timer clock
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 */
void imxrt_qtmr_deinit(TMR_Type *base, qtmr_channel_selection_t channel)
{
	/* Stop the counter */
	base->CHANNEL[channel].CTRL &= ~TMR_CTRL_CM_MASK;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
	/* Disable the module clock */
	imxrt_clock_disableclock(s_qtmrClocks[imxrt_qtmr_getinstance(base)]);
#endif							/* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief  Fill in the Quad Timer config struct with the default settings
 *
 * The default values are:
 * code
 *    config->debugMode = kQTMR_RunNormalInDebug;
 *    config->enableExternalForce = false;
 *    config->enableMasterMode = false;
 *    config->faultFilterCount = 0;
 *    config->faultFilterPeriod = 0;
 *    config->primarySource = kQTMR_ClockDivide_2;
 *    config->secondarySource = kQTMR_Counter0InputPin;
 * endcode
 * param config Pointer to user's Quad Timer config structure.
 */
void imxrt_qtmr_getdefaultconfig(qtmr_config_t *config)
{
	assert(config);

	/* Initializes the configure structure to zero. */
	memset(config, 0, sizeof(*config));

	/* Halt counter during debug mode */
	config->debugMode = kQTMR_RunNormalInDebug;

	/* Another counter cannot force state of OFLAG signal */
	config->enableExternalForce = false;

	/* Compare function's output from this counter is not broadcast to other counters */
	config->enableMasterMode = false;

	/* Fault filter count is set to 0 */
	config->faultFilterCount = 0;

	/* Fault filter period is set to 0 which disables the fault filter */
	config->faultFilterPeriod = 0;

	/* Primary count source is IP bus clock divide by 2 */
	config->primarySource = kQTMR_ClockDivide_2;

	/* Secondary count source is counter 0 input pin */
	config->secondarySource = kQTMR_Counter0InputPin;
}

/*!
 * brief Sets up Quad timer module for PWM signal output.
 *
 * The function initializes the timer module according to the parameters passed in by the user. The
 * function also sets up the value compare registers to match the PWM signal requirements.
 *
 * param base             Quad Timer peripheral base address
 * param channel          Quad Timer channel number
 * param pwmFreqHz        PWM signal frequency in Hz
 * param dutyCyclePercent PWM pulse width, value should be between 0 to 100
 *                         0=inactive signal(0% duty cycle)...
 *                         100=active signal (100% duty cycle)
 * param outputPolarity   true: invert polarity of the output signal, false: no inversion
 * param srcClock_Hz      Main counter clock in Hz.
 *
 * return Returns an error if there was error setting up the signal.
 */
status_t imxrt_qtmr_setuppwm(TMR_Type *base, qtmr_channel_selection_t channel, uint32_t pwmFreqHz, uint8_t dutyCyclePercent, bool outputPolarity, uint32_t srcClock_Hz)
{
	uint32_t periodCount, highCount, lowCount, reg;

	if (dutyCyclePercent > 100) {
		/* Invalid dutycycle */
		return kStatus_Fail;
	}

	/* Set OFLAG pin for output mode and force out a low on the pin */
	base->CHANNEL[channel].SCTRL |= (TMR_SCTRL_FORCE_MASK | TMR_SCTRL_OEN_MASK);

	/* Counter values to generate a PWM signal */
	periodCount = (srcClock_Hz / pwmFreqHz);
	highCount = (periodCount * dutyCyclePercent) / 100;
	lowCount = periodCount - highCount;

	/* Setup the compare registers for PWM output */
	base->CHANNEL[channel].COMP1 = lowCount;
	base->CHANNEL[channel].COMP2 = highCount;

	/* Setup the pre-load registers for PWM output */
	base->CHANNEL[channel].CMPLD1 = lowCount;
	base->CHANNEL[channel].CMPLD2 = highCount;

	reg = base->CHANNEL[channel].CSCTRL;
	/* Setup the compare load control for COMP1 and COMP2.
	 * Load COMP1 when CSCTRL[TCF2] is asserted, load COMP2 when CSCTRL[TCF1] is asserted
	 */
	reg &= ~(TMR_CSCTRL_CL1_MASK | TMR_CSCTRL_CL2_MASK);
	reg |= (TMR_CSCTRL_CL1(kQTMR_LoadOnComp2) | TMR_CSCTRL_CL2(kQTMR_LoadOnComp1));
	base->CHANNEL[channel].CSCTRL = reg;

	if (outputPolarity) {
		/* Invert the polarity */
		base->CHANNEL[channel].SCTRL |= TMR_SCTRL_OPS_MASK;
	} else {
		/* True polarity, no inversion */
		base->CHANNEL[channel].SCTRL &= ~TMR_SCTRL_OPS_MASK;
	}

	reg = base->CHANNEL[channel].CTRL;
	reg &= ~(TMR_CTRL_OUTMODE_MASK);

	/* Count until compare value is reached and re-initialize the counter, toggle OFLAG output
	 * using alternating compare register
	 */
	reg |= (TMR_CTRL_LENGTH_MASK | TMR_CTRL_OUTMODE(kQTMR_ToggleOnAltCompareReg));
	base->CHANNEL[channel].CTRL = reg;

	return kStatus_Success;
}

/*!
 * brief Allows the user to count the source clock cycles until a capture event arrives.
 *
 * The count is stored in the capture register.
 *
 * param base            Quad Timer peripheral base address
 * param channel         Quad Timer channel number
 * param capturePin      Pin through which we receive the input signal to trigger the capture
 * param inputPolarity   true: invert polarity of the input signal, false: no inversion
 * param reloadOnCapture true: reload the counter when an input capture occurs, false: no reload
 * param captureMode     Specifies which edge of the input signal triggers a capture
 */
void imxrt_qtmr_setupinputcapture(TMR_Type *base, qtmr_channel_selection_t channel, qtmr_input_source_t capturePin, bool inputPolarity, bool reloadOnCapture, qtmr_input_capture_edge_t captureMode)
{
	uint16_t reg;

	/* Clear the prior value for the input source for capture */
	reg = base->CHANNEL[channel].CTRL & (~TMR_CTRL_SCS_MASK);

	/* Set the new input source */
	reg |= TMR_CTRL_SCS(capturePin);
	base->CHANNEL[channel].CTRL = reg;

