Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_qtmr.c
	/* Clear the prior values for input polarity, capture mode. Set the external pin as input */
	reg = base->CHANNEL[channel].SCTRL & (~(TMR_SCTRL_IPS_MASK | TMR_SCTRL_CAPTURE_MODE_MASK | TMR_SCTRL_OEN_MASK));

	/* Set the new values */
	reg |= (TMR_SCTRL_IPS(inputPolarity) | TMR_SCTRL_CAPTURE_MODE(captureMode));
	base->CHANNEL[channel].SCTRL = reg;

	/* Setup if counter should reload when a capture occurs */
	if (reloadOnCapture) {
		base->CHANNEL[channel].CSCTRL |= TMR_CSCTRL_ROC_MASK;
	} else {
		base->CHANNEL[channel].CSCTRL &= ~TMR_CSCTRL_ROC_MASK;
	}
}

/*!
 * brief Enables the selected Quad Timer interrupts
 *
 * param base      Quad Timer peripheral base address
 * param channel   Quad Timer channel number
 * param mask      The interrupts to enable. This is a logical OR of members of the
 *                  enumeration ::qtmr_interrupt_enable_t
 */
void imxrt_qtmr_enableinterrupts(TMR_Type *base, qtmr_channel_selection_t channel, uint32_t mask)
{
	uint16_t reg;

	reg = base->CHANNEL[channel].SCTRL;

	/* Compare interrupt */
	if (mask & kQTMR_CompareInterruptEnable) {
		reg |= TMR_SCTRL_TCFIE_MASK;
	}

	/* Overflow interrupt */
	if (mask & kQTMR_OverflowInterruptEnable) {
		reg |= TMR_SCTRL_TOFIE_MASK;
	}
	/* Input edge interrupt */
	if (mask & kQTMR_EdgeInterruptEnable) {
		/* Restriction: Do not set both SCTRL[IEFIE] and DMA[IEFDE] */
		base->CHANNEL[channel].DMA &= ~TMR_DMA_IEFDE_MASK;
		reg |= TMR_SCTRL_IEFIE_MASK;
	}

	base->CHANNEL[channel].SCTRL = reg;

	reg = base->CHANNEL[channel].CSCTRL;

	/* Compare 1 interrupt */
	if (mask & kQTMR_Compare1InterruptEnable) {
		reg |= TMR_CSCTRL_TCF1EN_MASK;
	}

	/* Compare 2 interrupt */
	if (mask & kQTMR_Compare2InterruptEnable) {
		reg |= TMR_CSCTRL_TCF2EN_MASK;
	}

	base->CHANNEL[channel].CSCTRL = reg;
}

/*!
 * brief Disables the selected Quad Timer interrupts
 *
 * param base     Quad Timer peripheral base addres
 * param channel  Quad Timer channel number
 * param mask The interrupts to enable. This is a logical OR of members of the
 *             enumeration ::qtmr_interrupt_enable_t
 */
void imxrt_qtmr_disableinterrupts(TMR_Type *base, qtmr_channel_selection_t channel, uint32_t mask)
{
	uint16_t reg;

	reg = base->CHANNEL[channel].SCTRL;

	/* Compare interrupt */
	if (mask & kQTMR_CompareInterruptEnable) {
		reg &= ~TMR_SCTRL_TCFIE_MASK;
	}

	/* Overflow interrupt */
	if (mask & kQTMR_OverflowInterruptEnable) {
		reg &= ~TMR_SCTRL_TOFIE_MASK;
	}

	/* Input edge interrupt */
	if (mask & kQTMR_EdgeInterruptEnable) {
		reg &= ~TMR_SCTRL_IEFIE_MASK;
	}

	base->CHANNEL[channel].SCTRL = reg;

	reg = base->CHANNEL[channel].CSCTRL;

	/* Compare 1 interrupt */
	if (mask & kQTMR_Compare1InterruptEnable) {
		reg &= ~TMR_CSCTRL_TCF1EN_MASK;
	}

	/* Compare 2 interrupt */
	if (mask & kQTMR_Compare2InterruptEnable) {
		reg &= ~TMR_CSCTRL_TCF2EN_MASK;
	}

	base->CHANNEL[channel].CSCTRL = reg;
}

/*!
 * brief Gets the enabled Quad Timer interrupts
 *
 * param base    Quad Timer peripheral base address
 * param channel Quad Timer channel number
 *
 * return The enabled interrupts. This is the logical OR of members of the
 *         enumeration ::qtmr_interrupt_enable_t
 */
uint32_t imxrt_qtmr_getenabledinterrupts(TMR_Type *base, qtmr_channel_selection_t channel)
{
	uint32_t enabledInterrupts = 0;
	uint16_t reg;

	reg = base->CHANNEL[channel].SCTRL;

	/* Compare interrupt */
	if (reg & TMR_SCTRL_TCFIE_MASK) {
		enabledInterrupts |= kQTMR_CompareFlag;
	}

	/* Overflow interrupt */
	if (reg & TMR_SCTRL_TOFIE_MASK) {
		enabledInterrupts |= kQTMR_OverflowInterruptEnable;
	}

	/* Input edge interrupt */
	if (reg & TMR_SCTRL_IEFIE_MASK) {
		enabledInterrupts |= kQTMR_EdgeInterruptEnable;
	}

	reg = base->CHANNEL[channel].CSCTRL;

	/* Compare 1 interrupt */
	if (reg & TMR_CSCTRL_TCF1EN_MASK) {
		enabledInterrupts |= kQTMR_Compare1InterruptEnable;
	}

	/* Compare 2 interrupt */
	if (reg & TMR_CSCTRL_TCF2EN_MASK) {
		enabledInterrupts |= kQTMR_Compare2InterruptEnable;
	}

	return enabledInterrupts;
}

/*!
 * brief Gets the Quad Timer status flags
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 *
 * return The status flags. This is the logical OR of members of the
 *         enumeration ::qtmr_status_flags_t
 */
uint32_t imxrt_qtmr_getstatusflags(TMR_Type *base, qtmr_channel_selection_t channel)
{
	uint32_t statusFlags = 0;
	uint16_t reg;

	reg = base->CHANNEL[channel].SCTRL;

	/* Timer compare flag */
	if (reg & TMR_SCTRL_TCF_MASK) {
		statusFlags |= kQTMR_CompareFlag;
	}

	/* Timer overflow flag */
	if (reg & TMR_SCTRL_TOF_MASK) {
		statusFlags |= kQTMR_OverflowFlag;
	}

	/* Input edge flag */
	if (reg & TMR_SCTRL_IEF_MASK) {
		statusFlags |= kQTMR_EdgeFlag;
	}

	reg = base->CHANNEL[channel].CSCTRL;

	/* Compare 1 flag */
	if (reg & TMR_CSCTRL_TCF1_MASK) {
		statusFlags |= kQTMR_Compare1Flag;
	}

	/* Compare 2 flag */
	if (reg & TMR_CSCTRL_TCF2_MASK) {
		statusFlags |= kQTMR_Compare2Flag;
	}

	return statusFlags;
}

/*!
 * brief Clears the Quad Timer status flags.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param mask The status flags to clear. This is a logical OR of members of the
 *             enumeration ::qtmr_status_flags_t
 */
void imxrt_qtmr_clearstatusflags(TMR_Type *base, qtmr_channel_selection_t channel, uint32_t mask)
{
	uint16_t reg;

	reg = base->CHANNEL[channel].SCTRL;

	/* Timer compare flag */
	if (mask & kQTMR_CompareFlag) {
		reg &= ~TMR_SCTRL_TCF_MASK;
	}

	/* Timer overflow flag */
	if (mask & kQTMR_OverflowFlag) {
		reg &= ~TMR_SCTRL_TOF_MASK;
	}

	/* Input edge flag */
	if (mask & kQTMR_EdgeFlag) {
		reg &= ~TMR_SCTRL_IEF_MASK;
	}

	base->CHANNEL[channel].SCTRL = reg;

	reg = base->CHANNEL[channel].CSCTRL;
	
	/* Compare 1 flag */
	if (mask & kQTMR_Compare1Flag) {
		reg &= ~TMR_CSCTRL_TCF1_MASK;
	}

	/* Compare 2 flag */
	if (mask & kQTMR_Compare2Flag) {
		reg &= ~TMR_CSCTRL_TCF2_MASK;
	}

	base->CHANNEL[channel].CSCTRL = reg;
}

/*!
 * brief Sets the timer period in ticks.
 *
 * Timers counts from initial value till it equals the count value set here. The counter
 * will then reinitialize to the value specified in the Load register.
 *
 * note
 * 1. This function will write the time period in ticks to COMP1 or COMP2 register
 *    depending on the count direction
 * 2. User can call the utility macros provided in fsl_common.h to convert to ticks
 * 3. This function supports cases, providing only primary source clock without secondary source clock.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param ticks Timer period in units of ticks
 */
void imxrt_qtmr_settimerperiod(TMR_Type *base, qtmr_channel_selection_t channel, uint16_t ticks)
{
	uint32_t reg;
	/* Set the length bit to reinitialize the counters on a match */
	base->CHANNEL[channel].CTRL |= TMR_CTRL_LENGTH_MASK;

	if (base->CHANNEL[channel].CTRL & TMR_CTRL_DIR_MASK) {
		tmrvdbg("TMR Counting down\n");
		/* Counting down */
		base->CHANNEL[channel].COMP2 = ticks;
		/* Setting CMPLD2 register as well */
		base->CHANNEL[channel].CMPLD2 = ticks;
	} else {
		tmrvdbg("TMR Counting up\n");
		/* Counting up */
		base->CHANNEL[channel].COMP1 = ticks;
		/* Setting CMPLD1 register as well */
		base->CHANNEL[channel].CMPLD1 = ticks;
	}
}

uint32_t imxrt_qtmr_gettimerperiod(TMR_Type *base, qtmr_channel_selection_t channel)
{
	if (base->CHANNEL[channel].CTRL & TMR_CTRL_DIR_MASK) {
		/* Counting down */
		return base->CHANNEL[channel].COMP2;
	} else {
		/* Counting up */
		return base->CHANNEL[channel].COMP1;
	}
}

/*!
 * brief Enable the Quad Timer DMA.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param mask     The DMA to enable. This is a logical OR of members of the
 *                  enumeration ::qtmr_dma_enable_t
 */
void imxrt_qtmr_enabledma(TMR_Type *base, qtmr_channel_selection_t channel, uint32_t mask)
{
	uint16_t reg;

	reg = base->CHANNEL[channel].DMA;
	/* Input Edge Flag DMA Enable */
	if (mask & kQTMR_InputEdgeFlagDmaEnable) {
		/* Restriction: Do not set both DMA[IEFDE] and SCTRL[IEFIE] */
		base->CHANNEL[channel].SCTRL &= ~TMR_SCTRL_IEFIE_MASK;
		reg |= TMR_DMA_IEFDE_MASK;
	}
	/* Comparator Preload Register 1 DMA Enable */
	if (mask & kQTMR_ComparatorPreload1DmaEnable) {
		reg |= TMR_DMA_CMPLD1DE_MASK;
	}
	/* Comparator Preload Register 2 DMA Enable */
	if (mask & kQTMR_ComparatorPreload2DmaEnable) {
		reg |= TMR_DMA_CMPLD2DE_MASK;
	}
	base->CHANNEL[channel].DMA = reg;
}

/*!
 * brief Disable the Quad Timer DMA.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param mask     The DMA to enable. This is a logical OR of members of the
 *                  enumeration ::qtmr_dma_enable_t
 */
void imxrt_qtmr_disabledma(TMR_Type *base, qtmr_channel_selection_t channel, uint32_t mask)
{
	uint16_t reg;

	reg = base->CHANNEL[channel].DMA;
	/* Input Edge Flag DMA Enable */
	if (mask & kQTMR_InputEdgeFlagDmaEnable) {
		reg &= ~TMR_DMA_IEFDE_MASK;
	}
	/* Comparator Preload Register 1 DMA Enable */
	if (mask & kQTMR_ComparatorPreload1DmaEnable) {
		reg &= ~TMR_DMA_CMPLD1DE_MASK;
	}
	/* Comparator Preload Register 2 DMA Enable */
	if (mask & kQTMR_ComparatorPreload2DmaEnable) {
		reg &= ~TMR_DMA_CMPLD2DE_MASK;
	}
	base->CHANNEL[channel].DMA = reg;
}

