Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_qtmr.c
struct imxrt_qtmr_chipinfo_s *imxrt_qtmr_configure(int timer, qtmr_config_t *config, qtmr_channel_selection_t channel)
{
	struct imxrt_qtmr_chipinfo_s *qtmr = NULL;
	switch (timer) {
	case kQTMR_0:
		qtmr = &imxrt_qtmr0_chipinfo;
		break;

	case kQTMR_1:
		qtmr = &imxrt_qtmr1_chipinfo;
		break;

	case kQTMR_2:
		qtmr = &imxrt_qtmr2_chipinfo;
		break;

	case kQTMR_3:
		qtmr = &imxrt_qtmr3_chipinfo;
		break;
	}

	imxrt_qtmr_init(qtmr->base, channel, config);
	return qtmr;
}

static int imxrt_qtmr_handler(int irq, void *context, void *arg)
{
	struct imxrt_qtmr_lowerhalf_s *priv = (struct imxrt_qtmr_lowerhalf_s *)arg;
	struct imxrt_qtmr_chipinfo_s *qtmr = priv->qtmr;
	uint32_t next_interval_us = 0;
	uint32_t freq;
	uint64_t ticks;

	imxrt_qtmr_clearstatusflags(qtmr->base, priv->channel, kQTMR_Compare1Flag);

	if (priv->callback(&next_interval_us, priv->arg)) {
		if (next_interval_us > 0) {
			freq = imxrt_clock_getperclkfreq();
			ticks = ((uint64_t) freq * (uint64_t) next_interval_us) / USEC_PER_SEC;
			imxrt_qtmr_settimerperiod(priv->qtmr->base, priv->channel, ticks);
		}
	} else {
		imxrt_qtmr_stop((struct timer_lowerhalf_s *)priv);
	}

	return OK;
}

static void imxrt_qtmr_setisr(struct imxrt_qtmr_chipinfo_s *qtmr, xcpt_t handler, void *arg)
{
	irq_attach(qtmr->irq_id, handler, arg);
	up_enable_irq(qtmr->irq_id);
}

static void imxrt_qtmr_setcallback(struct timer_lowerhalf_s *lower, tccb_t callback, void *arg)
{
	struct imxrt_qtmr_lowerhalf_s *priv = (struct imxrt_qtmr_lowerhalf_s *)lower;
	irqstate_t flags = irqsave();

	/* Save the new callback */
	priv->callback = callback;
	priv->arg = arg;

	if (priv->callback != NULL) {
		imxrt_qtmr_setisr(priv->qtmr, imxrt_qtmr_handler, priv);
		imxrt_qtmr_enableinterrupts(priv->qtmr->base, priv->channel, kQTMR_Compare1InterruptEnable);
	} else {
		imxrt_qtmr_disableinterrupts(priv->qtmr->base, priv->channel, kQTMR_Compare1InterruptEnable);
		imxrt_qtmr_setisr(priv->qtmr, NULL, NULL);
	}

	irqrestore(flags);
}

static int imxrt_qtmr_settimeout(struct timer_lowerhalf_s *lower, uint32_t timeout)
{
	uint32_t freq;
	uint64_t ticks;
	struct imxrt_qtmr_lowerhalf_s *priv = (struct imxrt_qtmr_lowerhalf_s *)lower;

	if (priv->started) {
		return -EPERM;
	}

	freq = imxrt_clock_getperclkfreq();

	ticks = ((uint64_t) freq * (uint64_t) timeout) / USEC_PER_SEC;
	tmrdbg("freq:%d ticks:%llu, timeout = %lu\n", freq, ticks, timeout);

	if (ticks < USHRT_MAX) {
		imxrt_qtmr_settimerperiod(priv->qtmr->base, priv->channel, ticks);
	} else {
		tmrdbg("Ticks [%d] exceeds limit for this 16-bit QTMR timer counter [limit = %u]\n", ticks, USHRT_MAX);
		return -EINVAL;
	}

	imxrt_qtmr_settimerperiod(priv->qtmr->base, priv->channel, ticks);

	return OK;
}

static int imxrt_qtmr_getstatus(struct timer_lowerhalf_s *lower, struct timer_status_s *status)
{
	struct imxrt_qtmr_lowerhalf_s *priv = (struct imxrt_qtmr_lowerhalf_s *)lower;
	uint32_t ticks, timeout_ticks, cur_ticks;
	uint32_t freq;

	freq = imxrt_clock_getperclkfreq();

	/* Return the status bit */
	status->flags = 0;
	if (priv->started) {
		status->flags |= TCFLAGS_ACTIVE;
	}

	if (priv->callback) {
		status->flags |= TCFLAGS_HANDLER;
	}

	/* Return the actual timeout in microseconds */
	timeout_ticks = imxrt_qtmr_gettimerperiod(priv->qtmr->base, priv->channel);
	status->timeout = ((uint64_t)USEC_PER_SEC * (uint64_t)timeout_ticks) / freq;

	/* Get the time remaining until the timer expires (in microseconds). */
	cur_ticks = imxrt_qtmr_getcurrenttimercount(priv->qtmr->base, priv->channel);
	ticks = timeout_ticks - cur_ticks;
	status->timeleft = ((uint64_t)USEC_PER_SEC * (uint64_t)ticks) / freq;

	return OK;
}

static int imxrt_qtmr_ioctl(struct timer_lowerhalf_s *lower, int cmd, unsigned long arg)
{
	return -ENOTTY;
}

static int imxrt_qtmr_stop(struct timer_lowerhalf_s *lower)
{
	struct imxrt_qtmr_lowerhalf_s *priv = (struct imxrt_qtmr_lowerhalf_s *)lower;
	tmrvdbg("Stop timer [%d] channel [%d]\n", priv->tmr, priv->channel);

	if (priv->started) {
		imxrt_qtmr_disableinterrupts(priv->qtmr->base, priv->channel, kQTMR_Compare1InterruptEnable);

		imxrt_qtmr_stoptimer(priv->qtmr->base, priv->channel);

		imxrt_qtmr_setisr(priv->qtmr, NULL, NULL);
		priv->started = false;

		tmrvdbg("QTMR Timer %d channel %d is stopped\n", priv->tmr, priv->channel);
		return OK;
	}

	/* Return ENODEV to indicate that the timer was not running */
	tmrdbg("Error!! QTMR Timer %d channel %d is not running\n", priv->tmr, priv->channel);
	return -ENODEV;
}

static int imxrt_qtmr_start(struct timer_lowerhalf_s *lower)
{
	struct imxrt_qtmr_lowerhalf_s *priv = (struct imxrt_qtmr_lowerhalf_s *)lower;
	uint32_t enabled_interrupts;
	uint16_t counter;
	tmrvdbg("Start for timer[%d] channel [%d]\n", priv->tmr, priv->channel);

	if (!priv->started) {
		if (priv->callback != NULL) {
			imxrt_qtmr_enableinterrupts(priv->qtmr->base, priv->channel, kQTMR_Compare1InterruptEnable);
		}

		enabled_interrupts = imxrt_qtmr_getenabledinterrupts(priv->qtmr->base, priv->channel);
		enabled_interrupts &= kQTMR_Compare1InterruptEnable;
		if (enabled_interrupts) {
			tmrvdbg("enabled interrupt CMP1\n");
		}

		imxrt_qtmr_setisr(priv->qtmr, imxrt_qtmr_handler, priv);

		imxrt_qtmr_starttimer(priv->qtmr->base, priv->channel, kQTMR_PriSrcRiseEdge);

		priv->started = true;

		tmrvdbg("QTMR Timer %d Channel %d is started, callback %s\n", priv->tmr, priv->channel, priv->callback == NULL ? "none" : "set");

		return OK;
	}

	/* Return EBUSY to indicate that the timer was already running */
	tmrdbg("Error!! QTMR Timer %d Channel %d was already running\n", priv->tmr, priv->channel);
	return -EBUSY;
}

int imxrt_qtmr_initialize(const char *devpath, int timer)
{
	qtmr_config_t config;
	struct imxrt_qtmr_lowerhalf_s *lower = NULL;

	/* At present, only one channel is being utilised */
	int channel = 0;

	switch (timer) {
	case kQTMR_0:
		lower = &g_qtmr0_0_lowerhalf;
		break;

	case kQTMR_1:
		lower = &g_qtmr1_0_lowerhalf;
		break;

	case kQTMR_2:
		lower = &g_qtmr2_0_lowerhalf;
		break;

	case kQTMR_3:
		lower = &g_qtmr3_0_lowerhalf;
		break;
	}

	if (!lower) {
		return -ENODEV;
	}

	/* Initialize the elements of lower half state structure */
	lower->started = false;
	lower->callback = NULL;

	imxrt_qtmr_getdefaultconfig(&config);
	memcpy(&(lower->config), &config, sizeof(qtmr_config_t));
	lower->qtmr = imxrt_qtmr_configure(timer, &config, channel);
	lower->tmr = timer;
	lower->channel = channel;

	if (lower->qtmr == NULL) {
		return -EINVAL;
	}

	/*
	 * Register the timer driver as /dev/timerX.  The returned value from
	 * timer_register is a handle that could be used with timer_unregister().
	 * REVISIT: The returned handle is discard here.
	 */
	if (!timer_register(devpath, (struct timer_lowerhalf_s *)lower)) {
		/*
		 * The actual cause of the failure may have been a failure to allocate
		 * perhaps a failure to register the timer driver (such as if the
		 * 'depath' were not unique).  We know here but we return EEXIST to
		 * indicate the failure (implying the non-unique devpath).
		 */
		return -EEXIST;
	}

	return OK;
}
